{"/posts/Shubhra-Kar-Linux-Foundation-Training-(LiFT)-Scholarship":{"title":"Sharing My Success as a Shubhra Kar Linux Foundation Training (LiFT) Scholarship Winner🎉","data":{"":"I am thrilled to share some exciting news with my community! I have been selected as a proud recipient of the Shubhra Kar Linux Foundation Training (LiFT) Scholarship. This prestigious scholarship program aims to empower individuals who face financial constraints and lack access to high-quality training and certification opportunities in the field of open source technology. Through LiFT, I have been granted access to a top-notch course and one certification exam offered by the Linux Foundation, all completely free of charge.","program-overview#Program Overview:":"The Shubhra Kar Linux Foundation Training (LiFT) Scholarship Program is designed to foster diversity and inclusivity within the open source technology community. By removing financial barriers, the program provides deserving individuals, like myself, the chance to enhance their skills and knowledge in this rapidly growing field. The program is open to all passionate open source technology enthusiasts, especially those from underrepresented backgrounds. The Linux Foundation is committed to empowering individuals from diverse communities and providing them with the resources they need to succeed in their careers.","application-process-and-deadlines#Application Process and Deadlines:":"The application cycle for the Shubhra Kar Linux Foundation Training (LiFT) Scholarship Program is highly competitive, and I am honored to have been selected among numerous talented individuals. While the 2023 application cycle has concluded, I am excited to share that the next application window will open on April 1, 2024. I encourage all passionate open source technology enthusiasts, especially those from underrepresented backgrounds, to mark their calendars and seize this incredible opportunity to further their education and career aspirations.\nLinux Foundation LiFT Scholarship","benefits-of-the-lift-scholarship-program#Benefits of the LiFT Scholarship Program:":"As a LiFT scholarship winner, I have gained access to premium Linux Foundation training courses that are renowned for their quality and industry relevance. Additionally, I will have the opportunity to earn certifications in my chosen domain, which will significantly enhance my career prospects. These certifications are widely recognized within the industry and will enable me to showcase my expertise and stand out in the competitive job market. The LiFT Scholarship Program is truly a life-changing opportunity, providing me with invaluable resources to strengthen my skill set and deepen my knowledge in open source technology.","conclusion#Conclusion":"I am immensely grateful to the Shubhra Kar Linux Foundation Training (LiFT) Scholarship Program for selecting me as a recipient. This program is not only empowering me personally but also contributing to the broader goal of fostering diversity and inclusion within the open source technology community. I am excited to embark on this educational journey and make a positive impact in the field. To my fellow community members, I encourage you to stay informed about the next application cycle, as the LiFT Scholarship Program has the potential to transform your career as it has mine. Let's embrace this opportunity and collectively shape the future of open source technology together."}},"/posts/linux-foundation":{"title":"Enhance Your Skills with Free Linux Foundation Training Courses","data":{"":"As a undergraduate, you are aware of the importance of self-learning and continuous education in this ever-changing technological world. Thankfully, there are millions of free resources available on the internet to help you learn and upgrade your skills. One such valuable resource is the Linux Foundation's free training courses.The Linux Foundation is a non-profit organization that supports and promotes the growth of Linux and open-source software. The foundation offers a variety of free training courses that cover different topics and technologies. Whether you're a beginner or an expert, there's something for everyone.The courses offered by the Linux Foundation are self-paced and online, which means you can learn at your own pace and convenience. The training courses are designed by industry experts and cover various topics, including Linux administration, cloud computing, DevOps, and open-source software development.One of the popular courses offered by the Linux Foundation is the DevOps Fundamentals course. This course covers the fundamentals of DevOps, including continuous integration and deployment, containerization, and infrastructure as code. This course is ideal for software developers, system administrators, and IT professionals who want to learn DevOps practices.Another popular course is the Introduction to Linux course, which is suitable for beginners. This course covers the basics of Linux operating system, including command-line interface, file system, and software management. By the end of this course, you will have a good understanding of the Linux operating system and its components.The Linux Foundation also offers advanced courses, such as Kubernetes Fundamentals and OpenStack Administration. These courses are ideal for professionals who want to advance their careers in cloud computing and containerization.In conclusion, the Linux Foundation's free training courses are an excellent resource for anyone who wants to enhance their skills and knowledge in the field of open-source software and technologies. The courses are self-paced, online, and designed by industry experts, making them accessible to anyone, anywhere, and anytime. So, what are you waiting for? Start exploring the Linux Foundation's free training courses and take your career to the next level.Website Link - https://training.linuxfoundation.org/training/plan-your-training/"}},"/posts/my-story":{"title":"Why did I become an open-source enthusiast?","data":{"":"Firstly, I got my first computer when I was 10 years old. I played many games and watched animal videos on YouTube. When I was in grade 10, I found a Sri Lankan YouTube channel called Hacking.lk which featured hacking-related content. I became curious about hacking and installed Kali Linux to try many things I learned from those videos. However, it was limited as I had to focus on my schoolwork. During high school, I studied IT and had the chance to work with LibreOffice for the first time. I still use LibreOffice for academics, and I also learned about the disadvantages of using cracked software. I will discuss these disadvantages in my next article.Let's dive into the main reasons why I use open-source software. Firstly, it's free. Open-source software doesn't cost anything, which is cool. As a Sri Lankan student, I cannot personally afford to pay subscriptions or any payment for software that I need to use daily due to my financial background. This is my main reason.Secondly, we can trust open-source software because most of it is community-driven. It has communities all around the world, and the source code is available to anyone. When compared to closed software, we know they provide better software, but we do not know how they choose our personal details for marketing, etc. I know most of us never read terms and conditions in particular software; we just click click click... I know that, but it is not a good practice.Thirdly, the community is one reason I love open-source software. If you have a particular issue with your software, you can fix it easily by collaborating with the community. The community will help you to fix it, and you can learn more new things from them.Fourthly, there are many free alternative software options available for all of our work. For instance, if you are a video editor, most of you are using Adobe products. I am not saying that these software options are not good; they are excellent if you use them legally. But if you are using cracked versions, you can use open-source software like Blender. The first step is to search on the internet, and you can find whatever you want in open-source.If you are using cracked software, just think about how developers developed that software, their time, and sacrifice. We have to give credit to them. If they had not developed that software, how would you use it? How would you get money from your project? Just think about doing your best to value the developers.This is what I want to say. Thank you for your time reading this. This is my first article, and I'll continue it.In conclusion, my journey as an open-source enthusiast started with my curiosity about hacking and exploring Kali Linux. I discovered the advantages of using open-source software, including its cost-effectiveness, trustworthiness, supportive community, and the availability of free alternatives. It is crucial to appreciate and give credit to the developers who sacrifice their time and effort to develop these software options. As a Sri Lankan student with limited financial resources, open-source software has been a game-changer for me. I encourage others to explore these options and support the open-source community.","i-would-love-to-hear-your-thoughts-and-feedback-on-my-frist-article-#I would love to hear your thoughts and feedback on my frist article 😁":""}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}},"/projects":{"title":"projects🚀","data":{"":"Here's my current projects🚀This is a my new project,a free online resources library that will be a\ncommunity-driven learning platform. This project is still in the planning stage:)","vision#Vision":"My vision for this project is to provide better online resources for learners that are free and easily accessible.\nLearners should be able to access the best resources effortlessly and without difficulty.\nGitHub @mayura-andrew\nSite - (Coming Soon ...⚙️)"}},"/whoami":{"title":"whoami🤖","data":{"":"Hey 👋, My name is Mayura (Andrew) Alahakoon and I'm a 21-year-old Software Engineering undergraduate at The Open University of Sri Lanka🇱🇰.\nI am a dedicated and curious Software Engineer with a profound enthusiasm for open-source technologies.\nMy journey as an open-source enthusiast involves relentless exploration and experimentation with a\ndiverse array of technologies and tools, all aimed at continuously enhancing my expertise.\nI believe that open-source is the future of software development and I am committed to being a part of\nthis exciting and innovative movement. 🚀🤖👨‍💻\nEmail mayuraalahakoon@gmail.com\nLinkedIn @mayura-andrew\nGitHub @mayura-andrew"}},"/posts":{"title":"blog✍🏻","data":{"":""}},"/":{"title":"about😃","data":{"":"","mayura-andrew-#Mayura Andrew 👨🏻‍💻":"Hi!👋, Welcome to my minimalistic webpage. I'll continue sharing my projects and blogs here.\nIf you need to catch up with me, please click on \"whoami\" to learn more about me:) cheers!🍻"}},"/posts/containers":{"title":"Unlocking the Benefits of Containers for Computer Science Students","data":{"":"As a computer science student, you're likely familiar with the challenges of developing and deploying applications across different environments. Whether you're working on a team project, building a web application, or experimenting with machine learning, you need a consistent, efficient, and portable runtime environment to ensure that your code runs smoothly.This is where containers come in. Containers are a lightweight, standalone executable package of software that includes everything needed to run an application, including code, libraries, dependencies, and runtime. Containers are designed to be portable, meaning they can run on any machine with the appropriate container runtime installed, regardless of the underlying infrastructure.In this article, we'll explore why it's important for computer science students to understand containers and provide examples of how they can be used in university projects.","why-are-containers-important-for-computer-science-students#Why are containers important for computer science students?":"There are several reasons why it's important for computer science students to understand containers:Efficiency: Containers are much more lightweight than virtual machines (VMs), which means they use fewer resources and can be started and stopped more quickly. This makes them ideal for running multiple applications on a single machine or for deploying applications in a cloud environment where resources are shared.Consistency: Containers provide a consistent runtime environment, regardless of where the application is deployed. This means that developers can write code once and run it anywhere, without having to worry about differences in the underlying infrastructure.Reproducibility: Containers make it easy to reproduce application environments, which is essential for debugging and testing. Developers can create a container image that includes all the necessary dependencies and configurations, and then share that image with others to ensure everyone is working with the same environment.Portability: Containers are designed to be portable, meaning they can run on any machine with the appropriate container runtime installed, regardless of the underlying infrastructure. This makes them ideal for deploying applications in a cloud environment where resources are shared.Security: Containers provide a secure runtime environment, which means that applications running inside a container are isolated from the host system and other containers. This reduces the risk of malicious code or vulnerabilities affecting the host system or other containers.","how-can-containers-be-used-in-university-projects#How can containers be used in university projects?":"","here-are-some-examples-of-how-containers-can-be-used-in-university-projects#Here are some examples of how containers can be used in university projects:":"Database Management: In a database management project, you might need to use multiple database management systems such as MySQL, PostgreSQL, or MongoDB. Instead of installing these systems on your computer, you can create a container that includes all the required systems and dependencies. This container can then be shared with your team members, ensuring that everyone is working with the same environment.Web Development: In a web development project, you might need to use different web frameworks and programming languages such as Node.js, Ruby on Rails, or Django. Instead of installing each of these frameworks and languages on your computer, you can create a container that includes all the required frameworks and dependencies. This container can be easily shared with your team members, ensuring consistency and reducing the likelihood of environment-related bugs.Machine Learning: In a machine learning project, you might need to use different machine learning libraries and frameworks such as TensorFlow, PyTorch, or Scikit-learn. Instead of installing each of these libraries and frameworks on your computer, you can create a container that includes all the required libraries and dependencies. This container can be easily shared with your team members, ensuring consistency and reducing the likelihood of environment-related bugs.\nBy using containers in these types of university projects, students can simplify the process of setting up and deploying the required software, ensure consistency across team members, and reduce the likelihood of environment-related bugs.","conclusion#Conclusion":"In conclusion, containers are an important tool for computer science students to understand. They provide a lightweight, efficient, and consistent runtime environment that can be used for development, testing, and production deployment. By learning about containers and using them in university projects, students can gain valuable skills and experience that will prepare them for real-world challenges in the software industry.Note that this article generated from ChatGPT (https://chat.openai.com/chat) and edited by me.","resources#Resources":"IBM\nDocker\nRedHat\nWikipedia\nPodman\nKubernetes"}},"/posts/Discover-Golang:-A-Beginner's-Guide":{"title":"A Beginner's Guide and Free Resources to Learn Golang from an Early Stage Gopher","data":{"":"","what-is-go#What is Go?":"Go, often referred to as Golang, is an open-source programming language created by Google engineers Robert Griesemer, Rob Pike, and Ken Thompson. It was designed to be a language that combines the efficiency of low-level languages like C and C++ with the readability and simplicity of high-level languages like Python.","why-is-go-important-to-learn#Why is Go Important to Learn?":"","simplicity-and-readability#Simplicity and Readability":"One of the standout features of Go is its clean and simple syntax. The language is designed to be easy to read and write, making it an excellent choice for developers who want to focus on solving problems rather than dealing with complex syntax.","efficiency#Efficiency":"Go is compiled to machine code, providing the performance benefits of languages like C and C++. Its lightweight concurrency model and garbage collection make it well-suited for building scalable and efficient systems.","concurrency#Concurrency":"Concurrency is a first-class citizen in Go. The language includes built-in support for goroutines (lightweight threads) and channels, making it easier to write concurrent programs. This is particularly valuable in the era of multi-core processors and distributed systems.","advantages-and-disadvantages-of-go#Advantages and Disadvantages of Go":"","advantages#Advantages":"Efficiency: Go is known for its fast compilation times and runtime efficiency.\nConcurrency Support: The built-in concurrency primitives simplify the development of concurrent programs.\nStrong Standard Library: Go comes with a rich standard library that covers a wide range of functionalities.","key-features-in-go#Key Features in Go":"","goroutines-and-channels#Goroutines and Channels":"Goroutines and channels are the backbone of concurrent programming in Go. Goroutines are lightweight threads, and channels facilitate communication between them. This makes it easy to write concurrent and parallel programs.","static-typing#Static Typing":"Go is statically typed, which means that variable types are checked at compile-time. This helps catch errors early in the development process.","cross-platform-support#Cross-Platform Support":"Go provides excellent support for cross-platform development, allowing developers to build applications that run seamlessly on different operating systems.","free-resources-for-learning-go#Free Resources for Learning Go":"Go Documentation: The comprehensive documentation includes guides, articles, and the official blog.","online-course-coursera#Online Course (Coursera)":"Programming with Google Go Specialization by Prof. Ian Harris University of California, Irvine: This specialization introduces the Go programming language from Google and provides learners with an overview of Go's special features. Upon completing the three-course sequence, learners will have gained the knowledge and skills needed to create concise, efficient, and clean applications using Go.","youtube#YouTube":"Let's go with golang by Hitesh Choudhary: Explore the world of Go programming with this comprehensive YouTube playlist by Hitesh Choudhary. Whether you're a beginner or looking to enhance your Golang skills, this series covers a wide range of topics, from the basics to more advanced concepts. Hitesh's engaging teaching style makes learning Go enjoyable, and the playlist ensures a solid foundation in one of the most powerful and efficient programming languages. Dive into the exciting journey of Go development with this well-structured and informative resource.\nGolang Basics by Golang Dojo: Start your Golang journey with Golang Dojo's YouTube playlist. Perfect for beginners, it covers the fundamentals of Go programming, offering clear insights into the language. Whether you're new to coding or adding Golang to your skill set, this series provides a structured approach to master the basics. Explore Golang syntax, concepts, and best practices in these concise tutorials.\nGolang Tutorials by Tech With Tim: A comprehensive tutorial series introducing the Golang programming language. Tailored for absolute beginners eager to step into the realm of Go programming!\nData Structures in Golang Series by JamieDev: This playlist delves into fundamental data structures in #Golang, addressing topics like linked lists, heaps, stacks and queues, tries, graphs, and hash tables.\n\nIn conclusion, I'm still an early-stage developer deeply in love with the Go language, and I believe these free resources will help you all improve and learn more about the Go world. I hope you become Gophers. Go has emerged as a powerful language for modern development. Its simplicity, efficiency, and built-in support for concurrency make it an excellent choice for a variety of applications. Whether you are a seasoned developer or just starting your programming journey, exploring Go can open up new possibilities in your coding endeavors.Happy coding! 🧑‍💻"}}}